# CopyPasteOptions Properties

---
The CopyPasteOptions type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
CopyPasteOptions Class
Autodesk.Revit.DB Namespace